Autodesk.Revit.DB.BrowserOrganization.GetSortingParameterIdPath
The parameter Id path used to determine the sorting order of items in the browser.
Remarks:
A parameter Id path consists of reference parameter Id(s) {0...n} + paramId,
and the value of the last parameter in the path is the one that is used to determine the sorting order of items in the browser.
Reference parameter is ElementId valued parameter used to retrieve related element, its parameter value is the related element Id.
Given an Element, get the value of reference parameter and use the ElementId value to retrieve the referenced element.
Each paramId in the path except for the last one is a reference parameter pointing to the next element.
Recursively get next element through element obtained in the previous round with the next paramId in the path,
finally get the value of the last parameter.
Since:
2026

Autodesk.Revit.DB.BrowserOrganization.GetCurrentBrowserOrganizationForPanelSchedules(Autodesk.Revit.DB.Document)
Gets the Autodesk.Revit.DB.BrowserOrganization  that applies to the Panel Schedules section of the project browser.
document:
Revit document from which to get the organization data.
Returns:
The BrowserOrganization for panel schedules, or null if no panel schedules sections exist.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026